# -*- coding: utf-8 -*-
import random
import locale

loc = locale.getlocale()
locale.setlocale(locale.LC_ALL, "ru_RU.utf8")

names = ("Александр","Алексей","Анатолий","Андрей","Антон","Аркадий","Артём","Богдан","Борис","Вадим","Валентин","Валерий","Василий","Виктор","Виталий","Владимир","Владислав","Вячеслав","Гавриил","Геннадий","Георгий","Глеб","Григорий","Даниил","Данила","Денис","Дмитрий","Евгений","Егор","Кирилл","Иван","Игорь","Илья","Иннокентий","Лев","Леонид","Максим","Матвей","Михаил","Никита","Николай","Олег","Павел","Пётр","Роман","Ростислав","Руслан","Семён","Святослав","Сергей","Станислав","Степан","Тимофей","Тимур","Фёдор","Филипп","Эдуард","Юрий","Яков","Ярослав")
patronymics = ("Александрович","Алексеевич","Анатольевич","Андреевич","Антонович","Аркадьевич","Артёмович","Богданович","Борисович","Вадимович","Валентинович","Валерьевич","Васильевич","Викторович","Витальевич","Владимирович","Владиславович","Вячеславович","Гавриилович","Геннадьевич","Георгиевич","Глебович","Григорьевич","Даниилович","Данилович","Денисович","Дмитриевич","Евгеньевич","Егорович","Кириллович","Иванович","Игоревич","Ильич","Иннокентьевич","Львович","Леонидович","Максимович","Матвеевич","Михайлович","Никитич","Николаевич","Олегович","Павлович","Петрович","Романович","Ростиславович","Русланович","Семёнович","Святославович","Сергеевич","Станиславович","Степанович","Тимофеевич","Тимурович","Фёдорович","Филиппович","Эдуардович","Юрьевич","Яковлевич","Ярославович")
surnames = ("Смирнов","Иванов","Кузнецов","Новиков","Морозов","Петров","Павлов","Семёнов","Богданов","Воробьёв","Тарасов","Белов","Киселёв","Макаров","Андреев","Ковалёв","Ильин","Гусев","Титов","Кузьмин","Кудрявцев","Баранов","Куликов","Алексеев","Степанов","Яковлев","Сорокин","Сергеев","Романов","Захаров","Борисов","Королёв","Герасимов","Пономарёв","Григорьев","Лазарев","Ершов","Никитин","Соболев","Рябов","Цветков","Данилов","Журавлёв","Николаев","Крылов","Максимов","Сидоров","Осипов","Белоусов","Федотов","Дорофеев","Егоров","Матвеев","Бобров","Дмитриев","Анисимов","Антонов","Тимофеев","Никифоров","Веселов","Филиппов","Марков","Большаков","Суханов","Миронов","Ширяев","Александров","Коновалов","Шестаков","Казаков","Громов","Фомин","Давыдов","Мельников","Щербаков","Блинов","Колесников","Афанасьев","Власов","Исаков","Тихонов","Аксёнов","Родионов","Котов","Зуев","Панов","Рыбаков","Абрамов","Воронов","Мухин","Архипов","Трофимов","Горшков","Овчинников","Панфилов","Копылов","Лобанов","Лукин","Беляков","Потапов","Некрасов","Хохлов","Жданов","Наумов","Шилов","Воронцов","Ермаков","Дроздов","Игнатьев","Савин","Логинов","Сафонов","Капустин","Кириллов","Моисеев","Елисеев","Кошелев","Костин","Горбачёв","Орехов","Ефремов","Исаев","Евдокимов","Калашников","Кабанов","Носков","Юдин","Кулагин","Лапин","Прохоров","Нестеров","Харитонов","Агафонов","Муравьёв","Ларионов","Федосеев","Зимин","Пахомов","Шубин","Игнатов","Филатов","Крюков","Рогов","Кулаков","Терентьев","Молчанов","Владимиров","Артемьев","Гурьев","Зиновьев","Гришин","Кононов","Дементьев","Ситников","Симонов","Мишин","Фадеев","Комиссаров","Мамонтов","Носов","Гуляев","Шаров","Устинов","Вишняков","Евсеев","Лаврентьев","Брагин","Константинов","Корнилов","Авдеев","Зыков","Бирюков","Шарапов","Никонов","Щукин","Дьячков","Одинцов","Сазонов","Якушев","Красильников","Гордеев","Самойлов","Князев","Беспалов","Уваров","Шашков","Бобылёв","Доронин","Белозёров","Рожков","Самсонов","Мясников","Лихачёв","Буров","Сысоев","Фомичёв","Русаков","Стрелков","Гущин","Тетерин","Колобов","Субботин","Фокин","Блохин","Селиверстов","Пестов","Кондратьев","Силин","Меркушев","Лыткин","Туров")
departments = ("departament1", "departament2", "departament3")
positions = ("разработчик", "тестировщик", "ученый", "менеджер")

surnames_sort = sorted(surnames)
dd = [(random.choice(names), surname, random.choice(patronymics), random.choice(positions), random.choice(departments)) for surname in surnames_sort]
for rec in dd:
    print("    employee = Employee("
        "name='{0}',"
        "surname='{1}',"
        "patronymic='{2}',\n"
        "        birthday='1990-01-01',"
        "email='mail@mail.dev',"
        "phone='+70123456789',\n"
        "        start_working_date='2011-01-01',"
        "position='{3}',"
        "departament={4})".format(*rec))
    print "    employee.save()";
loc = locale.getlocale()